Tekla.Structures.Model.UI.PickInput
The PickInput class handles the input of picked objects and positions.
The following example asks the user to pick a face and then shows the input for the plug-in:
using Tekla.Structures.Model;
using Tekla.Structures.Model.UI;
using Tekla.Structures.Geometry3d;
using TSG = Tekla.Structures.Geometry3d;
using System;
using System.Collections;
using System.Windows.Forms;
public class Example
{
public void Example1()
{
Picker Picker = new Picker();
try
{
PickInput Input = Picker.PickFace("");
IEnumerator MyEnum = Input.GetEnumerator();
while (MyEnum.MoveNext())
{
InputItem Item = MyEnum.Current as InputItem;
if (Item.GetInputType() == InputItem.InputTypeEnum.INPUT_1_OBJECT)
{
ModelObject M = Item.GetData() as ModelObject;
MessageBox.Show(M.Identifier.ToString());
}
if (Item.GetInputType() == InputItem.InputTypeEnum.INPUT_POLYGON)
{
ArrayList Points = Item.GetData() as ArrayList;
MessageBox.Show((Points[0] as TSG.Point).ToString());
}
}
}
catch (Exception e)
{
MessageBox.Show(e.ToString());
}
}
}

Tekla.Structures.Model.UI.PickInput._InputItems
Contains all the Inputs, in the same order as they were entered

Tekla.Structures.Model.UI.PickInput.#ctor
Creates a new component input object.

Tekla.Structures.Model.UI.PickInput.AddInputPositions(Tekla.Structures.Geometry3d.Point)
Adds an input positions to the pick input. 1-n Positions
P: The position to be added.
Returns: True on success.

Tekla.Structures.Model.UI.PickInput.AddTwoInputPositions(Tekla.Structures.Geometry3d.Point,Tekla.Structures.Geometry3d.Point)
Adds two input positions to the pick input.
Position1: The first position to be added.
Position2: The second position to be added.
Returns: True on success.

Tekla.Structures.Model.UI.PickInput.AddInputPolygon(Tekla.Structures.Model.Polygon)
Adds a polygon to the pick input.
P: The polygon to be added.
Returns: True on success.

Tekla.Structures.Model.UI.PickInput.AddInputObject(Tekla.Structures.Model.ModelObject)
Adds a model object to the pick input.
M: The model object to be added.
Returns: True on success.

Tekla.Structures.Model.UI.PickInput.AddInputObjects(System.Collections.ArrayList)
Adds an array list of  model objects to the pick input.
PickObjects: A list of model objects in the correct order.
Returns: True on success.

Tekla.Structures.Model.UI.PickInput.CopyTo(System.Array,System.Int32)
Copies the elements of the  to
an , starting at a particular  index.
array:
The one-dimensional  that is the destination of the elements copied from
the . The  must have zero-based indexing.
index: The zero-based index in the array at which copying begins.
Throws System.ArgumentNullException: The array is null.
Throws System.ArgumentOutOfRangeException: The index is less than zero.
Throws System.ArgumentException:
The array is multidimensional, or the index is equal to or greater than the length of the array, or the number of elements
in the source  is greater than the available space from the index to
the end of the destination array.
Throws System.InvalidCastException:
The type of the source  cannot be cast automatically to the type of
the destination array.
2

Tekla.Structures.Model.UI.PickInput.Count
Gets the number of elements contained in the .
2

Tekla.Structures.Model.UI.PickInput.IsSynchronized
Gets a value indicating whether access to the  is synchronized (thread safe).
2

Tekla.Structures.Model.UI.PickInput.SyncRoot
Gets an object that can be used to synchronize access to the .
2

Tekla.Structures.Model.UI.PickInput.GetEnumerator
Returns an enumerator that iterates through a collection.
Returns: An  object that can be used to iterate through the collection.
2
using Tekla.Structures.Model;
using Tekla.Structures.Geometry3d;
using System;
using System.Collections;
public class Example
{
public void Example1()
{
Beam B = new Beam(new Point(12000, 0, 0), new Point(12000, 0, 6000));
B.Profile.ProfileString = "380*380";
B.Material.MaterialString = "K40-1";
if (B.Insert())
{
Component C = new Component();
C.Name = "Component Test";
C.Number = 30000063;
ComponentInput CI = new ComponentInput();
CI.AddInputObject(B);
C.SetComponentInput(CI);
C.LoadAttributesFromFile("standard");
C.SetAttribute("side_bar_space", 333.0);
if (!C.Insert())
{
Console.WriteLine("Component Insert failed");
}
else
{
// test fetching component input
ComponentInput ComponentSel = C.GetComponentInput();
IEnumerator Enumerator = ComponentSel.GetEnumerator();
while (Enumerator.MoveNext())
{
InputItem ObjectInput = Enumerator.Current as InputItem;
if (ObjectInput.GetInputType() == InputItem.InputTypeEnum.INPUT_1_OBJECT)
{
Beam BeamInput = ObjectInput.GetData() as Beam;
}
}
}
}
}
}